Repository: Onix-Systems/onix-flutter-project-generator
Catalog: lib/core/app/localization/l10n/intl_*.arb
Languages: uk

# apiFailureNoNetwork
source: Sorry, we're having trouble connecting. Please check your internet connection and try again. Reach out to support if you continue to experience issues.
uk: Вибачте, виникла проблема з підключенням. Будь ласка, перевірте інтернет з'єднання та спробуйте ще раз. Якщо проблема не вирішилась - зверніться до техпідтримки.

# apiFailureUnAuthorized
source: The username or password you entered is incorrect.
uk: Ім'я користувача або пароль не вірний.

# apiFailureTooManyRequests
source: Uh oh! Looks like we ran into an issue while processing this request. Please try again. Reach out to support if you continue to experience issues.
uk: Ой! Схоже, що в нас проблема з цим запитом. Будь ласка, спробуйте ще раз. Якщо проблема не вирішилась - зверніться до техпідтримки.

# apiFailureUndefined
source: Uh oh! Looks like we ran into an issue while processing this request. Please try again. Reach out to support if you continue to experience issues.
uk: Ой! Схоже, що в нас проблема з цим запитом. Будь ласка, спробуйте ще раз. Якщо проблема не вирішилась - зверніться до техпідтримки.

source: Cancel
uk: Відміна

source: Yes
uk: Так

source: No
uk: Ні

# continueLabel
source: Continue
uk: Продовжити

source: Modify
uk: Змінити

source: Delete
uk: Видалити

source: Error
uk: Помілка

source: Replace
uk: Замінити

source: Ignore
uk: Ігнорувати

source: Retry
uk: Повторити

# exitLabel
source: Exit
uk: Вийти

# swaggerParserScreenConflictError
source: Swagger file contains components conflicting with existing. Replace with parsed components or ignore conflicting parsed data?
uk: Файл Свагера містить компоненти, що конфліктують з тими що є. Замінити зпарсеними компоненами або ігнорувати конфліктуючі дані?

source: Generate new project
uk: Створити новий проект

source: Generate project
uk: Створити проект

# modifyGeneratedProject
source: Modify {projectName}
uk: Змінити {projectName}

source: Open existing project
uk: Відкрити існуючий проект

source: Project name
uk: Назва проекту

source: Project path
uk: Шлях до проекту

# projectExistsError
source: Project already exists, choose different name
uk: Проект з такою назвою вже існує

source: Organization
uk: Організація

# checkNamesTitle
source: Check names before continue
uk: Перевірте назву проекту та організацію перед тим, як продовжити

# checkNamesContentFirstPart
source: Is project name
uk: Назва проекту

# checkNamesContentSecondPart
source: and organization
uk: та організація

# checkNamesContentLastPart
source: looking reasonable?
uk: вас влаштовують?

# pathNotSelectedTitle
source: Path not selected
uk: Шлях до проекту не вибрано

# pathNotSelectedContent
source: You must select path to projects folder
uk: Будь ласка, виберіть шлях до проекту

# newVersionAvailableTitle
source: New version available
uk: Доступна нова версія

# newVersionAvailableContent
source: New version of Onix Flutter Project Generator is available. Do you want to download it?
uk: Доступна нова версія Onix Flutter Project Generator. Хочете її завантажити?

source: Add screen
uk: Додати екран

source: Modify screen
uk: Змінити екран

# screenAlreadyExistsTitle
source: Already exists
uk: Вже є

# screenAlreadyExistsContent
source: Screen with such name already exists
uk: Екран з такою назвою вже існує

source: Screen name
uk: Назва екрану

source: Screens
uk: Екрани

source: State manager
uk: Менеджер стану

source: Using BLoC
uk: Використати BLoC

source: Using Cubit
uk: Використати Cubit

source: Actions
uk: Дії

source: Localization:
uk: Локалізація:

source: Router:
uk: Роутер:

# useSonar
source: Will you use Sonar?
uk: Підключити Sonar?

source: Integrate GraphQL?
uk: Інтегрувати GraphQL?

source: Use Screen Util?
uk: Використовувати Screen Util?

source: Generate Sonar config?
uk: Згенерувати конфіг Sonar?

source: Modify signing vars...
uk: Змінити дані підпису...

source: (Dialog will open in separate window)
uk: (Діалог видкріється в окремому вікні)

source: Generate signing key?
uk: Згенерувати ключ підпису?

source: (space separated)
uk: (розділяти пробілами)

source: Add flavors:
uk: Додати флавори:

source: Flavorize?
uk: Генерувати флавори?

# willBeAddedAutomatically
source: DEV & PROD flavors will be added automatically
uk: DEV та PROD флавори будуть додані автоматично

source: Keystore password
uk: Пароль до сховища ключів

source: Two-letter country code
uk: Двохлітерний код країни

source: State or Province
uk: Штат або провінція

source: City or Locality
uk: Місто або локація

source: Organizational unit
uk: Організаційний підрозділ

source: First & last name
uk: Ім'я та прізвище

source: Signing vars
uk: Дані підпису

# swaggerParserPrompt
source: Paste swagger config json file URL here to get data components from API or leave it empty to use default config
uk: Вставте посилання на json файл конфігу свагера сюди для отримання компонентів від API або залиште пустим для продовженя без інтеграції API

source: Generate
uk: Генерувати

source: Request
uk: Запит

source: Response
uk: Відповідь

source: Data component
uk: Компонент даних

source: Data components
uk: Компоненти даних

source: Add component
uk: Додати компонент

source: Add source
uk: Додати джерело

source: Modify source
uk: Змінити джерело

# goBack
source: Back
uk: Назад

source: Modify component
uk: Змінити компонент

# componentNamePlaceholder
source: Component name
uk: Назва компонента

# createRequestCheckboxLabel
source: Create request?
uk: Створити запит?

# createResponseCheckboxLabel
source: Create response?
uk: Створити відповідь?

source: Standalone data components:
uk: Самостійні компоненти даних:

# sourceNamePlaceholder
source: Source name
uk: Назва джерела

source: Open in Android Studio
uk: Відкрити в Android Studio

source: Platforms
uk: Платформи

source: Flavors
uk: Флавори

source: Navigation router
uk: Навігаційний роутер

source: Localization method
uk: Метод локалізації

source: Generate screens
uk: Генерувати екрани

source: Sources
uk: Джерела

# emptyConfigTitle
source: Config file load error!
uk: Помилка читання файлу конфіга!

# emptyConfigContent
source: Config file is not exists or not valid! Check is opened project was generated with Onix Flutter Project Generator
uk: Файл конфіга вітсутній або невірний! Перевірте, чи був відкритий проект згенерований за допомогою Onix Flutter Project Generator

# gitPermissionsTitle
source: Git permissions error!
uk: Помилка доступу до Git!

# gitPermissionsContent
source: Git permissions error! Check is git installed and you have permissions to use it or try to add git key to apple keychain.
uk: Помилка доступу до Git! Перевірте, чи встановлений git та чи маєте ви права доступу до репозиторія або спробуйте додати ключ від git в Ключар.

source: Also read this
uk: Також прочитайте це

source: Get from swagger
uk: Отримати з свагера

# placeURLTitle
source: Place URL here
uk: Вставте URL сюди

# keyStorePasswordPlaceholder
source: Leave blank to auto-gen...
uk: Залиште пустим для автогенерації...

source: Nullable
uk: Опціональне

source: List
uk: Список

source: Fields
uk: Поля

source: Add field
uk: Додати поле

source: Preview
uk: Перегляд

# componentPreview
source: {componentName} component preview
uk: Перегляд компонента {componentName}

# sourceDeletingDialogTitle
source: Do you really want to delete source {sourceName}?
uk: Дійсно хочете видалити джерело {sourceName}?

source: With components
uk: З компонентами

# deleteComponentConfirmation
source: Do you really want to delete component {componentName}?
uk: Дійсно хочете видалити компонент {componentName}?

# sourceExistsError
source: {sourceName}Source already exists
uk: {sourceName}Source вже існує

# dataComponentExistsError
source: Data component {componentName} already exists
uk: Компонент {componentName} вже існує

# dataComponentExistsInSource
source: in {sourceName} source
uk: в джерелі {sourceName}

source: Get styles from Figma
uk: Отримати стилі з Figma

source: Figma file key
uk: Ключ файлу Figma

source: Figma token
uk: Токен Figma

# figmaGetStylesError
source: Error loading styles: check internet connection, figma file id and token
uk: Помилка завантаження стилів: перевірте інтернет з'єднання, id figma файлу та токен

# figmaGetStylesEmpty
source: No styles found in this file
uk: В цьому figma файлі не знайдено стилів

# figmaGetStylesEmptyFileId
source: Figma file id is empty
uk: Figma id пустий

# figmaGetStylesEmptyToken
source: Figma token is empty
uk: Figma token пустий

source: Mason Brick source
uk: Гілка Mason Brick

source: Text Styles
uk: Стилі тексту

source: Color Styles
uk: Кольори

source: Tools
uk: Інструменти

# projectSelectErrorTitle
source: Not a Flutter Project
uk: Не папка з проектом Flutter

# projectSelectErrorMessage
source: Pubspec file not found in selected folder.
uk: Pubspec файл не знайдено.

# signingToolTitle
source: Android signing configuration
uk: Сертифікат підпису Android

# signingToolSuccessText
source: Keystore and signing configuration created.
uk: Сертифікат та конфігурація підпису додана до проекту.

# generateAndroidSigning
source: Generate Android signing config
uk: Сконфігурувати підпис Android

# signingErrorParams
source: Failed to create signing config. Internal error happened, please contact a developer.
uk: Не вдалося завершити конфігурацію підпису. Відбулась внутрішня помилка, зв'яжіться з розробником.

# signingErrorException
source: Failed to create signing config. Is Android platform enabled and android folder exist?
uk: Не вдалося завершити конфігурацію підпису. Перевірте чи ваш проект містить папку android та чи вона відповідає проекту Android?

# signingErrorExist
source: Failed to create signing config. Certificate of configuration already exist.
uk: Не вдалося завершити конфігурацію підпису. Сертифікат або конфігурація вже існує.

source: Enter Project Name
uk: Введіть Ім'я Проекту

source: Select Project Platforms
uk: Виберіть Платформи

# selectProjectSetting
source: Select Project Features
uk: Налаштування Проекту

# selectProjectScreens
source: Add Screens to Generate
uk: Генерація Екранів

# initial
source: Initial screen?
uk: Початковий екран?

source: Import Styles
uk: Імпортувати Стилі

source: Get Styles
uk: Імпортувати

source: Clear
uk: Очистити

# addDataComponents
source: Data Components
uk: Компоненти Даних

# importApi
source: Import REST API requests
uk: Імпортувати запити REST API

source: Summary
uk: Підсумки

# parseErrorMessage
source: Failed to Parse Swagger Components. Please try again or contact support if issue not resolved.
uk: Не вдалося отримати компоненти Swagger. Спробуйте знову або зв'яжіться з підтримкою, якщо не вдається оторимати компоненти.

source: No data components
uk: Компоненти не знайдено

# projectNameHelperText
source: Project name must be fully lowercase, with underscores to separate words. Also make sure that the name is a valid Dart identifier - it does not start with numbers, is not a reserved word, and does not start or end with an underscore.
uk: Назва проєкту має бути повністю маленькими літерами, з підкресленнями, щоб відокремити слова. Також переконайтеся, що назва є дійсним ідентифікатором Dart - вона не починається з цифр, не є зарезервованим словом, не починається і не закінчується символом підкреслення

# organizationNameHelperText
source: A digit cannot be the first character in a package segment. The package must have at least one '.â€™ separator. Multiple '.' characters are not allowed in a row.
uk: Цифра не може бути першим символом у сегменті пакету. У пакеті повинен бути хоча б один роздільник '.'. Кілька символів '.' підряд не допускаються.
